/*!
 * @file   belEvent.h
 * @brief  
 * @author belmayze
 * 
 * Copyright (c) belmayze. All rights reserved.
 */
#pragma once

namespace bel {
//-----------------------------------------------------------------------------
class Event
{
    //-------------------------------------------------------------------------
    // ctor / dtor
    //-------------------------------------------------------------------------
public:
    //! コンストラクター
    Event();
    //! デストラクター
    ~Event();

    //-------------------------------------------------------------------------
    // event
    //-------------------------------------------------------------------------
public:
    /*!
     * イベントを待機します
     */
    bool wait();

    /*!
     * イベントにシグナルを送ります
     */
    bool signal();

    /*!
     * シグナルをリセットします
     */
    bool reset();

    //-------------------------------------------------------------------------
private:
#   if BEL_PLATFORM_IS_WIN()
    HANDLE mpHandle = HANDLE();
#   endif // BEL_PLATFORM_IS_WIN()
};
//-----------------------------------------------------------------------------
}
