/*!
 * @file   belIModule.h
 * @brief  
 * @author belmayze
 * 
 * Copyright (c) belmayze. All rights reserved.
 */
#pragma once

namespace bel {

//-----------------------------------------------------------------------------
class IModule
{
    //-------------------------------------------------------------------------
    // override
    //-------------------------------------------------------------------------
public:
    /*!
     * 初期化
     */
    virtual bool initialize() = 0;

    /*!
     * 計算処理
     */
    virtual void update() = 0;
};
//-----------------------------------------------------------------------------
} // bel::
